{
  "project": "Shai",
  "branchName": "ralph/port-exposure",
  "description": "Port Exposure for Container Servers - Enable users to expose TCP and UDP ports from the sandbox container to the host machine",
  "userStories": [
    {
      "id": "US-001",
      "title": "Add ports field to config schema",
      "description": "As a developer, I need to define port mappings in .shai/config.yaml so they are included when I launch a sandbox.",
      "acceptanceCriteria": [
        "Update config schema to include ports field in resource definitions",
        "Schema supports format: port: 8000 or port: {host: 8000, container: 8000, protocol: \"tcp\"}",
        "Validate port numbers are integers 1-65535",
        "Validate protocol is tcp or udp",
        "Default protocol to tcp if not specified",
        "Allow multiple ports in a single resource",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-002",
      "title": "Parse and validate port configurations",
      "description": "As a developer, I want configuration errors caught at load time so I know immediately if my port setup is invalid.",
      "acceptanceCriteria": [
        "Config loader validates all port definitions during YAML parsing",
        "Error messages identify invalid port numbers or protocols",
        "Error messages identify port conflicts (same host port used twice)",
        "Validation allows container port to differ from host port",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-003",
      "title": "Apply port mappings to Docker container",
      "description": "As a developer, I want the container to have access to the ports I defined so my server can bind to them.",
      "acceptanceCriteria": [
        "Docker container is started with --publish flags for each port",
        "Handles both TCP and UDP port mappings correctly",
        "Maps host port to container port as specified in config",
        "Container can bind to the container port and be accessible on host port",
        "Typecheck passes"
      ],
      "priority": 3,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-004",
      "title": "Display port information during bootstrap",
      "description": "As a developer, I want to see which ports are available when the sandbox starts so I know how to access my server.",
      "acceptanceCriteria": [
        "Print section showing exposed ports during bootstrap (e.g., \"Exposed Ports\")",
        "Format: localhost:8000 (tcp) → container:8000",
        "Include both TCP and UDP ports",
        "Print occurs after container is ready but before user shell/command runs",
        "Print is visible in both verbose and non-verbose modes",
        "Typecheck passes"
      ],
      "priority": 4,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-005",
      "title": "Support port configuration via resource sets",
      "description": "As a developer, I want to organize ports with other resources (mounts, calls, etc.) so related configuration stays grouped.",
      "acceptanceCriteria": [
        "Ports defined in a resource are loaded when that resource is activated",
        "Multiple resources can define ports (combined when multiple resources active)",
        "Ports from apply rules are included automatically",
        "CLI --resource-set flag correctly activates ports",
        "Typecheck passes"
      ],
      "priority": 5,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-006",
      "title": "Document port configuration in examples",
      "description": "As a developer, I want example configurations showing how to set up ports so I can copy and adapt them.",
      "acceptanceCriteria": [
        "Add port configuration example to .shai/config.yaml documentation",
        "Show basic HTTP server example (port 8000)",
        "Show multiple ports example (web + API)",
        "Show UDP example if applicable",
        "Include explanation of host vs container port mapping"
      ],
      "priority": 6,
      "passes": false,
      "notes": ""
    }
  ]
}
